FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
#include "sensorsLib.h"
#include "driver/gpio.h"
#include "logLib.h"

#include "esp_rom_sys.h"
#include "esp_timer.h"

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "driver/i2c_master.h"

#include "driver/spi_common.h"
#include "driver/spi_master.h"

#if CONFIG_USE_UDPLIB
#include "udpLib.h"
#endif

#if CONFIG_USE_ESPNOW
#include "espnowLib.h"
#endif

static const char * TAG = "sensors_library";

static volatile bool monitoring = false;

#if CONFIG_USE_INA226 || CONFIG_USE_MPU9250

#define SCL_GPIO 33
#define SDA_GPIO 32

//data transferred in MSB

i2c_master_bus_config_t master_cfg = {
    .clk_source = I2C_CLK_SRC_DEFAULT,
    .i2c_port = I2C_NUM_0,
    .scl_io_num = SCL_GPIO,
    .sda_io_num = SDA_GPIO,
    .glitch_ignore_cnt = 7,
    .flags.enable_internal_pullup = true,
};
i2c_master_bus_handle_t master_handle = NULL;
#endif

#define HEADER_SENSOR_SIZE (sizeof(uint8_t) + sizeof(uint8_t) + sizeof(uint32_t))

typedef struct header_sensor_st {
    uint8_t type;
    uint8_t esp_id;
    uint32_t timestamp;
} header_sensor_t;

static void serialize_header(header_sensor_t *hd, uint8_t *buf) {
    if (hd == NULL || buf == NULL) {
        return;
    }
    buf[0] = hd->type;
    buf[1] = hd->esp_id;
    memcpy(&buf[2], &hd->timestamp, sizeof(uint32_t)); //little-endian
}

#if CONFIG_USE_HCSR04

#define TRIG_PIN 27
#define ECHO_PIN 26
#define PULSE_TRIG_DURATION 10 //10us
#define ECHO_TIMEOUT 60 //60ms
#define HC_PERIOD 50

static SemaphoreHandle_t sem_hcsr = NULL;
static volatile int64_t echo_duration;

static void IRAM_ATTR echo_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;
    static int64_t last_timestamp = -1;

    if (gpio_get_level(ECHO_PIN) == 1) {
        last_timestamp = esp_timer_get_time();
    } else { //falling edge
        if (last_timestamp > 0) {
            echo_duration = esp_timer_get_time() - last_timestamp;
            xSemaphoreGiveFromISR(sem_hcsr, &taskAwoken);
            portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore (trig_echo)
        }
        last_timestamp = -1;  // reset
    }
}

static void print_hc(int64_t val) {
    log_msg(TAG, "value received: %lld, to centimeters: %.1fcm",
            val, val / 58.0);
}

esp_err_t init_hcsr() {
    esp_err_t err;

    //avoid re-initialization
    if (sem_hcsr != NULL) {
        log_msg(TAG, "HC-SR04 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_hcsr = xSemaphoreCreateBinary();
    if (sem_hcsr == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(TRIG_PIN);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), TRIG_PIN);
        return err;
    }
    err = gpio_reset_pin(ECHO_PIN);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), ECHO_PIN);
        return err;
    }

    err = gpio_set_direction(TRIG_PIN, GPIO_MODE_OUTPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), TRIG_PIN);
        return err;
    }
    err = gpio_set_direction(ECHO_PIN, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), ECHO_PIN);
        return err;
    }

    err = gpio_set_intr_type(ECHO_PIN, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), ECHO_PIN);
        return err;
    }
    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), ECHO_PIN);
        return err;
    }
    err = gpio_isr_handler_add(ECHO_PIN, echo_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), ECHO_PIN);
        return err;
    }
    //or gpio_isr_register()
    log_msg(TAG, "HC-SR04 initialized");
    return ESP_OK;
    
}

int64_t trigger_echo() {
    esp_err_t err;

    if (sem_hcsr == NULL) {
        return -1;
    }

    //log_msg(TAG, "Triggering echo..");

    err = gpio_set_level(TRIG_PIN, 1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), TRIG_PIN);
        return -1;
    }
    esp_rom_delay_us(PULSE_TRIG_DURATION);
    err = gpio_set_level(TRIG_PIN, 0);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), TRIG_PIN);
        return -1;
    }

    //log_msg(TAG, "Echo triggered");

    if (xSemaphoreTake(sem_hcsr, pdMS_TO_TICKS(ECHO_TIMEOUT)) == pdFALSE) {
        return -1; //after tiemout
    } else {
        return echo_duration; //semaphore given from ISR
    }
}

#define HC_PAYLOAD_SIZE sizeof(int64_t)

/**
 * 50 ms monitoring HC task
 */
static void hc_task(void * params) {
    esp_err_t err;
    
    int64_t val_hc;
    err = init_hcsr();
    if (err != ESP_OK){
        return;
    }

    while (monitoring)
    {
        val_hc = trigger_echo(); //blocking

        if (val_hc >= 0 && val_hc < 30000) {
    
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = 1;
            uint8_t buf[HEADER_SENSOR_SIZE + HC_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            memcpy(&buf[HEADER_SENSOR_SIZE], &val_hc, sizeof(int64_t));
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(HC_PERIOD));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_INA226

#define INA_ADDR 0x40
#define INA_PERIOD 70

//pointer towards i2c device
i2c_master_dev_handle_t ina_handle;

//describe ina i2c device
i2c_device_config_t ina_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = INA_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency (400khz supported by ina)
};

static void print_ina(ina_info_t *ina) {
    log_msg(TAG, "Shunt received: %d, value: %.3fmV", ina->shunt, ina->shunt * 2.5e-6f * 1e3f);
    log_msg(TAG, "Bus received: %d, value: %.3fV", ina->bus, ina->bus * 1.25e-3f);
    log_msg(TAG, "Power received: %d, value: %.3fmW", ina->power, ina->power * 25e-6f * 25 * 1e3f);
    log_msg(TAG, "Current received: %d, value: %.3fmA", ina->current, ina->current * 25e-6f * 1e3f);
}

