FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    if (lvl == 1 && last_lvl == 0) {
        ky_info.signal_count++;
        ky_info.signal_duration = now - last_timestamp;
        last_timestamp = now;
        log_msg(TAG, "[instant]; tr/s : %.3f, v: %.3fm/s, v: %.3fkm/h", 
            1.0 / (ky_info.signal_duration * 1e-6),
            3.14 * 6.75e-2 / (ky_info.signal_duration * 1e-6),
            3.6 * 3.14 * 6.75e-2 / (ky_info.signal_duration * 1e-6));
        return (ky_info_t*)&ky_info;
    }
    
    last_lvl = lvl;

    return NULL;
}

/**
 * Periodic KY monitoring task
 */
static void ky_task(void * params) {

    int raw_val;
    int64_t last_timestamp = 0;
    bool last_state = false;
    const TickType_t poll_delay = pdMS_TO_TICKS(10);

    while (monitoring) {
        esp_err_t err = adc_oneshot_read(adc1_handle, ADC_CHANNEL_6, &raw_val);
        if (err != ESP_OK) {
            vTaskDelay(poll_delay);
            continue;
        }

        bool current_state = (raw_val < 1800);
        //log_msg(TAG, "voltage: %dmV", raw_val);

        if (current_state && !last_state) {
            int64_t now = esp_timer_get_time();
            if (last_timestamp != 0) {
                ky_info_t snapshot = {
                    .signal_count    = ++ky_info.signal_count,
                    .signal_duration = now - last_timestamp,
                };
                ky_info.signal_duration = snapshot.signal_duration;
                
                header_sensor_t header = {0};
                header.esp_id = (uint8_t)CONFIG_ESP_ID;
                header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                header.type = 0;
                uint8_t buf[HEADER_SENSOR_SIZE + KY_PAYLOAD_SIZE];
                serialize_header(&header, buf);
                serialize_ky(&snapshot, buf);
                
            #if CONFIG_USE_UDPLIB
                send_udp_sensor(buf, sizeof(buf));
            #endif
            #if CONFIG_USE_ESPNOW
            #endif

            }
            last_timestamp = now;
        }

        last_state = current_state;
        vTaskDelay(poll_delay);
    }
    vTaskDelete(NULL);
}

//signal of KY-003 is analogic, so edge interruptions don't work.
//even here, in the function we could have an invalid value of gpio level
//especially with fast polling
//this leads to an invalid count

//another way is by using ADC with one shot read
//and according to voltage, decide if the magnet should be considered or not
//this would correct the error of invalid count

//still same issue, and if period < 10ms, the ADC oneshot generates an error
//due to mutex timeout for adc

#endif

#if CONFIG_USE_MPU9250

#define AK8963_ADDR 0x0C
#define BMP_ADDR 0x76
#define MPU_ADDR 0b1101000
#define MPU_PERIOD 50

//pointer towards i2c device
i2c_master_dev_handle_t mpu_handle;

//describe ina i2c device
i2c_device_config_t mpu_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = MPU_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency
};

//pointer towards i2c device
i2c_master_dev_handle_t bmp_handle;

//describe ina i2c device
i2c_device_config_t bmp_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = BMP_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency
};

//structure to store pressure calibration values from BMP
typedef struct bmp_dig_p_st {
    uint16_t dig_P1;
    int16_t  dig_P2;
    int16_t  dig_P3;
    int16_t  dig_P4;
    int16_t  dig_P5;
    int16_t  dig_P6;
    int16_t  dig_P7;
    int16_t  dig_P8;
    int16_t  dig_P9;
} bmp_dig_p_t;

//structure to store temperature calibration values from BMP
typedef struct bmp_dig_t_st {
    uint16_t dig_T1;
    int16_t  dig_T2;
    int16_t  dig_T3;
} bmp_dig_t_t;

static bmp_dig_p_t cal_dig_p;
static bmp_dig_t_t cal_dig_t;

//calibration value to determine pressure using temperature
static int32_t t_fine;

static void print_mpu(mpu_info_t *mpu) {
    log_msg(TAG, "Accel_X received: %d", mpu->accel_x);
    log_msg(TAG, "Accel_Y received: %d", mpu->accel_y);
    log_msg(TAG, "Accel_Z received: %d", mpu->accel_z);
    log_msg(TAG, "Gyro_X received: %d", mpu->gyro_x);
    log_msg(TAG, "Gyro_Y received: %d", mpu->gyro_y);
    log_msg(TAG, "Gyro_Z received: %d", mpu->gyro_z);
    log_msg(TAG, "Temperature MPU received: %d, value: %.3f°C",
        mpu->temp_mpu,(mpu->temp_mpu - 0.0)/333.87 + 21.0);
    log_msg(TAG, "Temperature BMP received: %d, value: %.2f°C", mpu->temp_bmp,
        mpu->temp_bmp / 100.0);
    log_msg(TAG, "Pressure received: %d, value: %.3fbar", mpu->pressure, mpu->pressure * 1e-5);
}

/**
 * Initialize MPU9250 sensor i2c
 */
esp_err_t init_mpu() {
    esp_err_t err;

    //config of i2c registers, gpio, start
    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

    err = i2c_master_bus_add_device(master_handle, &mpu_cfg, &mpu_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding mpu device to master bus", esp_err_to_name(err));
        return err;
    }

    err = i2c_master_bus_add_device(master_handle, &bmp_cfg, &bmp_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding bmp device to master bus", esp_err_to_name(err));
        return err;
    }

    //reboot mpu
    uint8_t pwr_data[] = {0x6B, 0x00};

    pwr_data[1] |= 1 << 7; //reset

    err = i2c_master_transmit(mpu_handle, pwr_data, sizeof(pwr_data), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) waking up mpu", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(100)); //wait for reboot

    //mpu device identifier
    uint8_t reg = 0x75;
    uint8_t who;
    err = i2c_master_transmit_receive(mpu_handle, &reg, 1, &who, 1, -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting who am i mpu", esp_err_to_name(err));
        return err;
    }
    log_msg(TAG, "WHO_AM_I mpu: 0x%02X", who);

    //reboot bmp
    uint8_t reset_bmp_data[] = {0xE0, 0xB6};

    err = i2c_master_transmit(bmp_handle, reset_bmp_data, sizeof(reset_bmp_data), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting bmp", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(10)); //wait for reboot

