FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    err = convert_pressure(&mpu_info->pressure);
    if (err != ESP_OK) return err;

    //other formulas on datasheet

    return ESP_OK;
}

#define MPU_PAYLOAD_SIZE (7 * sizeof(int16_t) + 2 * sizeof(int32_t))

static void serialize_mpu(mpu_info_t *mpu, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len] ,&mpu->accel_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->temp_mpu, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->pressure, sizeof(int32_t));
    len += sizeof(int32_t);
    memcpy(&buf[len] ,&mpu->temp_bmp, sizeof(int32_t));
}

/**
 * 50 ms monitoring MPU task
 */
static void mpu_task(void * params) {
    esp_err_t err;
    mpu_info_t mpu_info;

    err = init_mpu();
    if (err != ESP_OK){
        vTaskDelete(NULL);
    }

    while (monitoring)
    {
        err = get_mpu_info(&mpu_info);

        if (err == ESP_OK) {
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = 2;
            uint8_t buf[HEADER_SENSOR_SIZE + MPU_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            serialize_mpu(&mpu_info, buf);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(MPU_PERIOD));
    }
    vTaskDelete(NULL);
}
#endif

#if CONFIG_USE_RFID_RC522

#define PIN_NUM_MISO 19
#define PIN_NUM_MOSI 23
#define PIN_NUM_CLK  18
#define PIN_NUM_CS   21
#define PIN_NUM_RST  22

#define RC522_REG_VERSION  0x37
#define RC522_REG_TX_CONTROL 0x14

// Registres du RC522
#define RC522_REG_COMMAND      0x01
#define RC522_REG_COMM_EN      0x02
#define RC522_REG_COMM_IRQ     0x04
#define RC522_REG_ERROR        0x06
#define RC522_REG_FIFO_DATA    0x09
#define RC522_REG_FIFO_LEVEL   0x0A
#define RC522_REG_CONTROL      0x0C
#define RC522_REG_BIT_FRAMING  0x0D

// Commandes du RC522 (PCD)
#define PCD_IDLE               0x00
#define PCD_TRANSCEIVE         0x0C // Transmet et reçoit des données RF

// Commandes des Cartes/Badges (PICC)
#define PICC_REQA              0x26 // Request Type A (cherche une carte)
#define PICC_ANTICOLL          0x93 // Anti-collision (demande l'UID)
#define PICC_HALT              0x50 // Met la carte en sommeil

#define RC522_REG_MODE          0x11  // Registre de définition du mode de transmission
#define RC522_REG_TX_ASK        0x15  // Registre de configuration de la modulation TX
#define RC522_REG_RF_CFG        0x26  // Registre du Gain de l'antenne

// Fonction pour ÉCRIRE dans un registre du RC522
static void rc522_write_reg(spi_device_handle_t spi, uint8_t reg, uint8_t val) {
    uint8_t tx_data[2];
    // Formate l'adresse : MSB = 0 (Write), adresse décalée, LSB = 0
    tx_data[0] = (reg << 1) & 0x7E; 
    tx_data[1] = val; // La valeur à injecter

    spi_transaction_t t = {
        .length = 16,           // 2 octets = 16 bits à transmettre
        .tx_buffer = tx_data,
        .rx_buffer = NULL       // On n'attend rien en retour
    };

    // Envoi immédiat sur le bus
    spi_device_polling_transmit(spi, &t);
}

// Fonction pour LIRE un registre du RC522
static uint8_t rc522_read_reg(spi_device_handle_t spi, uint8_t reg) {
    uint8_t tx_data[2];
    uint8_t rx_data[2];
    
    // Formate l'adresse : MSB = 1 (Read), adresse décalée, LSB = 0
    tx_data[0] = ((reg << 1) & 0x7E) | 0x80; 
    tx_data[1] = 0x00; // Octet de bourrage (dummy) pour laisser la puce répondre

    spi_transaction_t t = {
        .length = 16,           // 16 bits (8 bits adresse + 8 bits réponse)
        .tx_buffer = tx_data,
        .rx_buffer = rx_data
    };

    spi_device_polling_transmit(spi, &t);

    // Le premier octet reçu pendant qu'on envoyait l'adresse est vide.
    // Le vrai résultat est dans le deuxième octet.
    return rx_data[1]; 
}

static esp_err_t rc522_to_card(spi_device_handle_t spi, uint8_t command, 
                               uint8_t *send_data, uint8_t send_len, 
                               uint8_t *back_data, uint32_t *back_len) {
    
    // 1. On nettoie les anciens ordres et les interruptions
    rc522_write_reg(spi, RC522_REG_COMMAND, PCD_IDLE);
    rc522_write_reg(spi, RC522_REG_COMM_IRQ, 0x7F);
    
    // 2. On vide le FIFO et on s'assure qu'il est prêt
    rc522_write_reg(spi, RC522_REG_FIFO_LEVEL, 0x80); 

    // 3. On injecte nos données à envoyer dans le FIFO
    for (int i = 0; i < send_len; i++) {
        rc522_write_reg(spi, RC522_REG_FIFO_DATA, send_data[i]);
    }

    // 4. On exécute la commande (généralement PCD_TRANSCEIVE)
    rc522_write_reg(spi, RC522_REG_COMMAND, command);
    if (command == PCD_TRANSCEIVE) {
        // Donne l'ordre d'envoyer immédiatement les bits stockés dans le FIFO
        rc522_write_reg(spi, RC522_REG_BIT_FRAMING, rc522_read_reg(spi, RC522_REG_BIT_FRAMING) | 0x80);
    }

    // 5. On attend que la puce reçoive une réponse (timeout après ~25ms)
    int i = 2000;
    uint8_t n;
    do {
        n = rc522_read_reg(spi, RC522_REG_COMM_IRQ);
        i--;
    } while (i > 0 && !(n & 0x01) && !(n & 0x30)); // Attend la fin du traitement ou une erreur

    // On arrête l'émission immédiate
    rc522_write_reg(spi, RC522_REG_BIT_FRAMING, rc522_read_reg(spi, RC522_REG_BIT_FRAMING) & 0x7F);

    if (i == 0) return ESP_ERR_TIMEOUT; // Personne n'a répondu

    // 6. On vérifie s'il y a des erreurs de protocole
    uint8_t error_reg = rc522_read_reg(spi, RC522_REG_ERROR);
    if (error_reg & 0x13) return ESP_FAIL; // Collision ou erreur de parité

    // 7. Si tout va bien et que l'appelant veut récupérer les données reçues
    if (back_data && back_len) {
        uint8_t fifo_len = rc522_read_reg(spi, RC522_REG_FIFO_LEVEL);
        if (fifo_len > *back_len) fifo_len = *back_len;
        
        *back_len = fifo_len;
        for (int i = 0; i < fifo_len; i++) {
            back_data[i] = rc522_read_reg(spi, RC522_REG_FIFO_DATA);
        }
    }

    return ESP_OK;
}

