FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    vTaskDelete(NULL);
}

#endif

esp_err_t init_sensors() {

    esp_err_t err;
    BaseType_t res;

    if (monitoring) {
        log_msg_lvl(ESP_LOG_WARN, TAG, "Sensors already initialized");
        return ESP_FAIL;
    }

#if CONFIG_USE_HCSR04
    int64_t echo_temp = 0, echo_res = 0;
    res = xTaskCreate(hc_task, "hc_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating HC monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_INA226
    ina_info_t ina = {0}, ina_temp;
    res = xTaskCreate(ina_task, "ina_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating INA monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_MPU9250
    mpu_info_t mpu = {0}, mpu_temp;
    res = xTaskCreate(mpu_task, "mpu_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating mpu monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_KY003
    err = init_ky();
    if (err != ESP_OK){
        return ESP_FAIL;
    }
    ky_info_t ky = {0}, ky_temp;
    res = xTaskCreate(ky_task, "ky_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_RFID_RC522

    res = xTaskCreate(rfid_rc522_task, "rfid_rc522_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating rfid_rc522 monitoring task", res);
        return ESP_FAIL;
    }

#endif

    monitoring = true;
    return ESP_OK;
}